"""
Syntax error :รูปแบบของไวยากรณ์ผิด, 
              ข้อความหรือรูปแบบของการจัดเรียงประโยคคำสั่งต่างๆผิดพลาดไป ทำให้โปรแกรม error

Runtime error : error เมื่อโปรแกรมกำลังรันอยู่, 
                เช่น เราสร้างโปรแกรมที่จำเป็นต้องรับค่าเป็นตัวเลข แต่ผู้ใช้กรอกข้อมูลมาเป็น string ทำให้โปรแกรม error

Semantic error : ความหมายผิดเพี้ยน, 
                error ประเภทนี้ไม่ได้ทำให้โปรแกรมหยุดทำงานแล้วแจ้งเตือน 
                แต่โปรแกรมของเราทำงานได้ไม่ตรงตามที่ควรจะเป็นเช่นเราอาจจะกำหนดสมการผิด 
                ทำให้จากเดิมที่ลูกค้าจะต้องได้เงินกลายเป็นเสียเงิน เป็นต้น
"""